In [5]:
# imports and load data from store_data.csv
import pandas as pd

df = pd.read_csv("../00.Data/store_data.csv")

In [2]:
# explore data

In [6]:
df.head()

         week  storeA  storeB  storeC  storeD  storeE
0  2014-05-04    2643    8257    3893    6231    1294
1  2014-05-11    6444    5736    5634    7092    2907
2  2014-05-18    9646    2552    4253    5447    4736
3  2014-05-25    5960   10740    8264    6063     949
4  2014-06-01    7412    7374    3208    3985    3023

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   week    200 non-null    object
 1   storeA  200 non-null    int64
 2   storeB  200 non-null    int64
 3   storeC  200 non-null    int64
 4   storeD  200 non-null    int64
 5   storeE  200 non-null    int64
dtypes: int64(5), object(1)
memory usage: 9.5+ KB

# Which store has the highest total sales for the final month of data?

In [12]:
# total sales for the last month
# Last month starts from Index 196 till end
df.iloc[196:, 1:].sum()

storeA    25127
storeB    24595
storeC    16447
storeD    22783
storeE     7787
dtype: int64

as per finding, Store A is the Top Store which sales are the largest for last month.

# Which store makes the most sales on average?

In [13]:
# average sales
df.iloc[:, 1:].mean()

storeA    5865.480
storeB    6756.710
storeC    4942.105
storeD    5431.405
storeE    2580.025
dtype: float64

As per finding, Store B made the most sales on average.

# Which store sells the most during the week of March 13th, 2016?

In [14]:
# sales on march 13, 2016
df.head()

         week  storeA  storeB  storeC  storeD  storeE
0  2014-05-04    2643    8257    3893    6231    1294
1  2014-05-11    6444    5736    5634    7092    2907
2  2014-05-18    9646    2552    4253    5447    4736
3  2014-05-25    5960   10740    8264    6063     949
4  2014-06-01    7412    7374    3208    3985    3023

In [17]:
df[df["week"] == "2016-03-13"]

          week  storeA  storeB  storeC  storeD  storeE
97  2016-03-13    2054    1390    5112    5513    2536

As per finding, Store D sold the most during the week of March 13, 2016.

# In what week does store C make its worst sales?

In [26]:
# worst week for store C
df.sort_values(by=["storeC"], ascending=True)[["week", "storeC"]]

           week  storeC
9    2014-07-06     927
90   2016-01-24    2036
11   2014-07-20    2104
178  2017-10-01    2286
145  2017-02-12    2332
..          ...     ...
94   2016-02-21    7890
13   2014-08-03    7993
22   2014-10-05    8259
3    2014-05-25    8264
147  2017-02-26    8293

[200 rows x 2 columns]

In [28]:
# worst week for store C
df[df["storeC"] == df["storeC"].min()][["week", "storeC"]]

         week  storeC
9  2014-07-06     927

As per finding, week of 6 July 2014 was the worst sales week for Store C.

# Which store has the most sales in the latest 3-month period?

In [29]:
# total sales during most recent 3 month period
df.tail()

           week  storeA  storeB  storeC  storeD  storeE
195  2018-01-28     282    6351    7759    5558    1028
196  2018-02-04    4853    6503    4187    5956    1458
197  2018-02-11    9202    3677    4540    6186     243
198  2018-02-18    3512    7511    4151    5596    3501
199  2018-02-25    7560    6904    3569    5045    2585

In [32]:
last_three_months = df[df['week'] >= '2017-12-01']
last_three_months

           week  storeA  storeB  storeC  storeD  storeE
187  2017-12-03    5179    3850    6121    6778     113
188  2017-12-10    9348    5624    5446    5448     227
189  2017-12-17    5310    8647    5680    7049    3578
190  2017-12-24    8976    9503    6240    3882    2890
191  2017-12-31   11875    1527    6711    5265    1701
192  2018-01-07    8978   11312    4158    5019    3842
193  2018-01-14    6963    4014    4215    7153    3097
194  2018-01-21    5553    3971    3761    6255    3071
195  2018-01-28     282    6351    7759    5558    1028
196  2018-02-04    4853    6503    4187    5956    1458
197  2018-02-11    9202    3677    4540    6186     243
198  2018-02-18    3512    7511    4151    5596    3501
199  2018-02-25    7560    6904    3569    5045    2585

In [34]:
last_three_months.iloc[:, 1:].sum()

storeA    87591
storeB    79394
storeC    66538
storeD    75190
storeE    27334
dtype: int64